"""
每一种编程语言都包含处理数字和数学计算的方法
在过往的学习语言中，我们都学到的这些方法
所以，这也是我们学习编程语言的必经之路

在《笨方法学习Python》中，这一节看到一条笑话就是：程序员经常说自己是多么牛的数学天才，其实他们根本不是。
如果他们真的是数学天才，他们早就去从事数学相关的行业了，而不是写写广告程序和社交网络游戏，
从人们身上赚点小钱而已了

这应该是程序员又被黑的一次了

python中数学计算的方式有：
+:plus 加号
-:minus 减号
/:slash 斜杠
*:asterisk 星号
%:percent 百分号
<:less-than 小于号
>:greater-than 大于号
<=:less-than-equal 小于等于号
>=:greater-than-equal 大于等于号
"""
print("我现在计算出我的结果：")
print("fuck",25+25)
print("you",100-25*3%4)
print("现在用其他方式计算：")
print(3+2+1-5+6%2-1/4+6)
print("比较3+2<5-7")
print(3+2<5-7)
print("3+2=",3+2)
print("5-7=",5-7)
